---
Description: download Firefox for MacOS
Identifier: com.github.macadmins.Firefox-Mac
Input:
  NAME: Firefox
  # https://download.mozilla.org/?product=firefox-latest-ssl&os=osx&lang=en-US
MinimumVersion: "2.3"
Process:
  - Processor: URLDownloaderPython
    Arguments:
      filename: Firefox.dmg
      url: https://download.mozilla.org/?product=firefox-latest-ssl&os=osx&lang=en-US
      COMPUTE_HASHES: True

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/TextSearcher
    Arguments:
      input_string: "%download_url%"
      # example: https://download-installer.cdn.mozilla.net/pub/firefox/releases/128.0/mac/en-US/Firefox%20128.0.dmg
      re_pattern: 'releases/(?P<version>\d+(\.\d+)+)/'
