---
Description: download Firefox for MacOS
Identifier: com.github.macadmins.Firefox-Mac
Input:
  NAME: Firefox
  os: osx
  filename: Firefox.dmg
  # https://download.mozilla.org/?product=firefox-latest-ssl&os=osx&lang=en-US
  # https://download.mozilla.org/?product=firefox-latest-ssl&os=win64&lang=en-US
MinimumVersion: "2.3"
Process:
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      url: https://download.mozilla.org/?product=firefox-latest-ssl&os=%os%&lang=en-US
      COMPUTE_HASHES: True

  - Processor: EndOfCheckPhase

  - Processor: com.github.jgstew.SharedProcessors/TextSearcher
    Arguments:
      input_string: "%download_url%"
      # example: https://download-installer.cdn.mozilla.net/pub/firefox/releases/128.0/mac/en-US/Firefox%20128.0.dmg
      re_pattern: 'releases/(?P<version>\d+(\.\d+)+)/'

  - Processor: com.github.jgstew.SharedProcessors/DateTimeFromString
    Arguments:
      # parse last_modified header info from URLDownloaderPython
      datetime_string: "%last_modified%"
      datetime_strptime: "%a, %d %b %Y %H:%M:%S %Z"
      datetime_strftime: "%Y-%m-%d"
      datetime_parsed_name: SourceReleaseDate

  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem

  - Processor: com.github.jgstew.SharedProcessors/FileHasher

  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppend
    Arguments:
      dictionary_name: template_dictionary
      append_key: file_sha256
      append_value: "%filehasher_sha256%"
